app/controllers/avatars_controller.rb

SELECT "avatars".* FROM "avatars"
---
    def index
        avatars = Avatar.all

SELECT  "avatars".* FROM "avatars" WHERE "avatars"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        avatar = Avatar.find(params[:id])