app/controllers/players_controller.rb

    def index
        players = Player.all
---
SELECT "players".* FROM "players"

    def show
        player = Player.find_by(name: params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."name" = $1 LIMIT $2  [["name", "Harum"], ["LIMIT", 1]]

    def update
        player = Player.find(params[:id])
        player.update(high_score: params[:data][:high_score])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "players" SET "high_score" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["high_score", 0], ["updated_at", "2019-09-11 15:46:39.116890"], ["id", 3]]